# FOR SCORE BOOK PREPROCESSING
PIECE = {}

PIECE['piri'] = [
  '여민락', '밑도드리', '웃도드리', '도드리 돌장', '영산회상 상령산', '영산회상 중령산', '영산회상 세령산', '영산회상 가락덜이', '영산회상 상현도드리',
  '영산회상 하현도드리', '영산회상 염불도드리', '영산회상 타령', '영산회상 군악', '천년만세 계면가락도드리', '천년만세 양청도드리', '천년만세 우조가락도드리',
  '평조회상 상령산', '평조회상 중령산', '평조회상 세령산', '평조회상 가락덜이', '평조회상 상현도드리', '평조회상 염불도드리', '평조회상 타령',
  '평조회상 군악', '관악영산회상 상령산', '관악영산회상 중령산', '관악영산회상 세령산', '관악영산회상 가락덜이', '관악영산회상 상현도드리', '관악영산회상 염불도드리',
  '관악영산회상 타령', '관악영산회상 군악', '취타 취타', '취타 길군악', '취타 길타령', '취타 별우조타령', '취타 군악', '수제천', '동동', '자진한잎 경풍년 우조두거',
  '자진한잎 경풍년 변조두거', '자진한잎 염양춘', '자진한잎 수룡음 농', '자진한잎 수룡음 계락', '자진한잎 수룡음 편1',  '자진한잎 수룡음 편2',
  '우조 다스름', '남창우조 초수대엽', '남창우조 이수대엽', '남창우조 중거', '남창우조 평거', '남창우조 두거', '남창우조 삼수대엽', '남창우조 소용이',
  '남창우조 우롱', '남창우조 우락', '남창우조 언락', '남창우조 우편', '남창반우반계 반엽', '가곡 계면 다스름', '남창계면 초수대엽', '남창계면 이수대엽',
  '남창계면 중거', '남창계면 평거', '남창계면 두거', '남창계면 삼수대엽', '남창계면 소용이', '남창계면 언롱', '남창계면 평롱', '남창계면 계락',
  '남창반우반계 편락', '남창계면 편수대엽', '남창계면 언편', '남창계면 태평가', '여창우조 이수대엽', '여창우조 중거', '여창우조 평거', '여창우조 두거',
  '여창우조 우락', '여창반우반계 반엽', '여창계면 이수대엽', '여창계면 중거', '여창계면 평거', '여창계면 두거', '여창계면 평롱', '여창계면 계락', 
  '여창반우반계 환계락', '여창계면 편수대엽', '여창계면 태평가',
  '보허자', '독주곡 상령산', '독주곡 염양춘', '현악취타 취타', '현악취타 길군악', '현악취타 길타령', '현악취타 별우조타령', '현악취타 군악'
]

PIECE['daegeum'] = [
  '여민락', '밑도드리', '웃도드리', '도드리 돌장', '영산회상 상령산', '영산회상 중령산', '영산회상 세령산', '영산회상 가락덜이', '영산회상 상현도드리',
  '영산회상 하현도드리', '영산회상 염불도드리', '영산회상 타령', '영산회상 군악', '천년만세 계면가락도드리', '천년만세 양청도드리', '천년만세 우조가락도드리',
  '평조회상 상령산', '평조회상 중령산', '평조회상 세령산', '평조회상 가락덜이', '평조회상 상현도드리', '평조회상 염불도드리', '평조회상 타령',
  '평조회상 군악','관악영산회상 상령산', '관악영산회상 중령산', '관악영산회상 세령산', '관악영산회상 가락덜이', '관악영산회상 상현도드리', '관악영산회상 염불도드리',
  '관악영산회상 타령', '관악영산회상 군악', '취타 취타', '취타 길군악', '취타 길타령', '취타 별우조타령', '취타 군악','수제천', '동동', '자진한잎 경풍년 우조두거',
  '자진한잎 경풍년 변조두거', '자진한잎 염양춘', '자진한잎 수룡음 농', '자진한잎 수룡음 계락', '자진한잎 수룡음 편1',  '자진한잎 수룡음 편2',
  '우조 다스름', '남창우조 초수대엽', '남창우조 이수대엽', '남창우조 중거', '남창우조 평거', '남창우조 두거', '남창우조 삼수대엽', '남창우조 소용이',
  '남창우조 우롱', '남창우조 우락', '남창우조 언락', '남창우조 우편', '남창반우반계 반엽', '가곡 계면 다스름', '남창계면 초수대엽', '남창계면 이수대엽',
  '남창계면 중거', '남창계면 평거', '남창계면 두거', '남창계면 삼수대엽', '남창계면 소용이', '남창계면 언롱', '남창계면 평롱', '남창계면 계락',
  '남창반우반계 편락', '남창계면 편수대엽', '남창계면 언편', '남창계면 태평가', '여창우조 이수대엽', '여창우조 중거', '여창우조 평거', '여창우조 두거',
  '여창우조 우락', '여창반우반계 반엽', '여창계면 이수대엽', '여창계면 중거', '여창계면 평거', '여창계면 두거', '여창계면 평롱', '여창계면 계락', 
  '여창반우반계 환계락', '여창계면 편수대엽', '여창계면 태평가',
  '해령', '보허자', '독주곡 헌천수', '독주곡 상령산1', '독주곡 상령산2', '독주곡 청성자진한잎', 
  '현악취타 취타', '현악취타 길군악', '현악취타 길타령', '현악취타 별우조타령', '현악취타 군악'
]

PIECE['haegeum'] = [
  '여민락', 
  '밑도드리', '웃도드리', '도드리 돌장', 
  '영산회상 상령산', '영산회상 중령산', '영산회상 세령산', '영산회상 가락덜이', '영산회상 상현도드리', '영산회상 하현도드리', '영산회상 염불도드리', '영산회상 타령', '영산회상 군악', '천년만세 계면가락도드리', '천년만세 양청도드리', '천년만세 우조가락도드리',
  '평조회상 상령산', '평조회상 중령산', '평조회상 세령산', '평조회상 가락덜이', '평조회상 상현도드리', '평조회상 염불도드리', '평조회상 타령', '평조회상 군악',
  '관악영산회상 상령산', '관악영산회상 중령산', '관악영산회상 세령산', '관악영산회상 가락덜이', '관악영산회상 상현도드리', '관악영산회상 염불도드리', '관악영산회상 타령', '관악영산회상 군악', 
  '취타 취타', '취타 길군악', '취타 길타령', '취타 별우조타령', '취타 군악',
  '수제천', '동동',
  '자진한잎 경풍년 우조두거','자진한잎 경풍년 변조두거', '자진한잎 염양춘', '자진한잎 수룡음 농', '자진한잎 수룡음 계락', '자진한잎 수룡음 편1',  '자진한잎 수룡음 편2',
  '우조 다스름', '남창우조 초수대엽', '남창우조 이수대엽', '남창우조 중거', '남창우조 평거', '남창우조 두거', '남창우조 삼수대엽', '남창우조 소용이',
  '남창우조 우롱', '남창우조 우락', '남창우조 언락', '남창우조 우편', '남창반우반계 반엽', '가곡 계면 다스름', '남창계면 초수대엽', '남창계면 이수대엽',
  '남창계면 중거', '남창계면 평거', '남창계면 두거', '남창계면 삼수대엽', '남창계면 소용이', '남창계면 언롱', '남창계면 평롱', '남창계면 계락',
  '남창반우반계 편락', '남창계면 편수대엽', '남창계면 언편', '남창계면 태평가', '여창우조 이수대엽', '여창우조 중거', '여창우조 평거', '여창우조 두거',
  '여창우조 우락', '여창반우반계 반엽', '여창계면 이수대엽', '여창계면 중거', '여창계면 평거', '여창계면 두거', '여창계면 평롱', '여창계면 계락', 
  '여창반우반계 환계락', '여창계면 편수대엽', '여창계면 태평가',
  '보허자',
  '현악취타 취타', '현악취타 길군악', '현악취타 길타령', '현악취타 별우조타령', '현악취타 군악'
]

PIECE['ajaeng'] = [
  '여민락', 
  '밑도드리', #'웃도드리', '도드리 돌장', 
  # '영산회상 상령산', '영산회상 중령산', '영산회상 세령산', '영산회상 가락덜이', '영산회상 상현도드리', '영산회상 하현도드리', '영산회상 염불도드리', '영산회상 타령', '영산회상 군악', '천년만세 계면가락도드리', '천년만세 양청도드리', '천년만세 우조가락도드리',
  '평조회상 상령산', '평조회상 중령산', '평조회상 세령산', '평조회상 가락덜이', '평조회상 상현도드리', '평조회상 염불도드리', '평조회상 타령', '평조회상 군악',
  '관악영산회상 상령산', '관악영산회상 중령산', '관악영산회상 세령산', '관악영산회상 가락덜이', '관악영산회상 상현도드리', '관악영산회상 염불도드리', '관악영산회상 타령', '관악영산회상 군악', 
  '취타 취타', '취타 길군악', '취타 길타령', '취타 별우조타령', '취타 군악',
  '수제천', '동동',
  '자진한잎 경풍년 우조두거','자진한잎 경풍년 변조두거', '자진한잎 염양춘', '자진한잎 수룡음 농', '자진한잎 수룡음 계락', '자진한잎 수룡음 편1',  '자진한잎 수룡음 편2',
  # '우조 다스름', '남창우조 초수대엽', '남창우조 이수대엽', '남창우조 중거', '남창우조 평거', '남창우조 두거', '남창우조 삼수대엽', '남창우조 소용이',
  # '남창우조 우롱', '남창우조 우락', '남창우조 언락', '남창우조 우편', '남창반우반계 반엽', '가곡 계면 다스름', '남창계면 초수대엽', '남창계면 이수대엽',
  # '남창계면 중거', '남창계면 평거', '남창계면 두거', '남창계면 삼수대엽', '남창계면 소용이', '남창계면 언롱', '남창계면 평롱', '남창계면 계락',
  # '남창반우반계 편락', '남창계면 편수대엽', '남창계면 언편', '남창계면 태평가', '여창우조 이수대엽', '여창우조 중거', '여창우조 평거', '여창우조 두거',
  # '여창우조 우락', '여창반우반계 반엽', '여창계면 이수대엽', '여창계면 중거', '여창계면 평거', '여창계면 두거', '여창계면 평롱', '여창계면 계락', 
  # '여창반우반계 환계락', '여창계면 편수대엽', '여창계면 태평가',
  '보허자',
  # '현악취타 취타', '현악취타 길군악', '현악취타 길타령', '현악취타 별우조타령', '현악취타 군악'
]


PIECE['gayageum'] = [
  '여민락', 
  '밑도드리', '웃도드리', '도드리 돌장', 
  '영산회상 상령산', '영산회상 중령산', '영산회상 세령산', '영산회상 가락덜이', '영산회상 상현도드리', '영산회상 하현도드리', '영산회상 염불도드리', '영산회상 타령', '영산회상 군악', '천년만세 계면가락도드리', '천년만세 양청도드리', '천년만세 우조가락도드리',
  '평조회상 상령산', '평조회상 중령산', '평조회상 세령산', '평조회상 가락덜이', '평조회상 상현도드리', '평조회상 염불도드리', '평조회상 타령', '평조회상 군악',
  # '관악영산회상 상령산', '관악영산회상 중령산', '관악영산회상 세령산', '관악영산회상 가락덜이', '관악영산회상 상현도드리', '관악영산회상 염불도드리', '관악영산회상 타령', '관악영산회상 군악', 
  '취타 취타', '현악취타 수요남극지곡', # '취타 길군악', '취타 길타령', '취타 별우조타령', '취타 군악',
  # '수제천', '동동',
  '보허사',
  '우조 다스름', '남창우조 초수대엽', '남창우조 이수대엽', '남창우조 중거', '남창우조 평거', '남창우조 두거', '남창우조 삼수대엽', '남창우조 소용이',
  '남창우조 우롱', '남창우조 우락', '남창우조 언락', '남창우조 우편', '남창반우반계 반엽', '가곡 계면 다스름', '남창계면 초수대엽', '남창계면 이수대엽',
  '남창계면 중거', '남창계면 평거', '남창계면 두거', '남창계면 삼수대엽', '남창계면 소용이', '남창계면 언롱', '남창계면 평롱', '남창계면 계락',
  '남창반우반계 편락', '남창계면 편수대엽', '남창계면 언편', '남창계면 태평가', '여창우조 이수대엽', '여창우조 중거', '여창우조 평거', '여창우조 두거',
  '여창우조 우락', '여창반우반계 반엽', '여창계면 이수대엽', '여창계면 중거', '여창계면 평거', '여창계면 두거', '여창계면 평롱', '여창계면 계락', 
  '여창반우반계 환계락', '여창계면 편수대엽', '여창계면 태평가',
  '자진한잎 경풍년 우조두거','자진한잎 경풍년 변조두거', '자진한잎 염양춘', '자진한잎 수룡음 농', '자진한잎 수룡음 계락', '자진한잎 수룡음 편1',  '자진한잎 수룡음 편2',
  '현악취타 취타', '현악취타 길군악', '현악취타 길타령', '현악취타 별우조타령', '현악취타 군악'
]

PIECE['geomungo'] = [
  '여민락', 
  '밑도드리', '웃도드리', '도드리 돌장', 
  '영산회상 상령산', '영산회상 중령산', '영산회상 세령산', '영산회상 가락덜이', '영산회상 상현도드리', '영산회상 하현도드리', '영산회상 염불도드리', '영산회상 타령', '영산회상 군악', 
  '영산회상 하현도드리 해탄가락', '영산회상 타령 해탄가락', '영산회상 군악 해탄가락',
  '천년만세 계면가락도드리', '천년만세 양청도드리', '천년만세 우조가락도드리', '천년만세 계면가락도드리 해탄가락',
  '평조회상 상령산', '평조회상 중령산', '평조회상 세령산', '평조회상 가락덜이', '평조회상 상현도드리', '평조회상 염불도드리', '평조회상 타령', '평조회상 군악',
  # '관악영산회상 상령산', '관악영산회상 중령산', '관악영산회상 세령산', '관악영산회상 가락덜이', '관악영산회상 상현도드리', '관악영산회상 염불도드리', '관악영산회상 타령', '관악영산회상 군악', 
  '취타 취타', '현악취타 수요남극지곡',
  # '수제천', '동동',
  '보허사',
  '우조 다스름', '남창우조 초수대엽', '남창우조 이수대엽', '남창우조 중거', '남창우조 평거', '남창우조 두거', '남창우조 삼수대엽', '남창우조 삼수대엽 고음부', '남창우조 삼수대엽 저음부', '남창우조 소용이',
  '남창우조 우롱', '남창우조 우락', '남창우조 언락', '남창우조 우편', '남창반우반계 반엽', '가곡 계면 다스름', '남창계면 초수대엽', '남창계면 이수대엽',
  '남창계면 중거', '남창계면 평거', '남창계면 두거', '남창계면 삼수대엽 고음부', '남창계면 삼수대엽 저음부', '남창계면 소용이', '남창계면 언롱', '남창계면 평롱1', '남창계면 평롱2', '남창계면 계락',
  '남창반우반계 편락', '남창계면 편수대엽', '남창계면 언편', '남창계면 태평가', '여창우조 이수대엽', '여창우조 중거', '여창우조 평거', '여창우조 두거',
  '여창우조 우락', '여창반우반계 반엽', '여창계면 이수대엽', '여창계면 중거1', '여창계면 중거2', '여창계면 평거', '여창계면 두거 고음부', '여창계면 두거 저음부', '여창계면 평롱', '여창계면 계락', 
  '여창반우반계 환계락', '여창계면 편수대엽', '여창계면 태평가',
  '자진한잎 경풍년 우조두거','자진한잎 경풍년 변조두거', '자진한잎 염양춘', '자진한잎 수룡음 농', '자진한잎 수룡음 계락', '자진한잎 수룡음 편1',  '자진한잎 수룡음 편2',
  '현악취타 취타', '현악취타 길군악', '현악취타 길타령', '현악취타 별우조타령', '현악취타 군악'
]


START_PAGE = {}
START_PAGE['piri'] = 21
START_PAGE['daegeum'] = 16
START_PAGE['haegeum'] = 19
START_PAGE['geomungo'] = 17
START_PAGE['gayageum'] = 21
START_PAGE['ajaeng'] = 13


PAGE_REPAIRS = {
  'piri_pg-074': [
    {
      'type': 'line',
      'vertices': [
        (1523, 490),
        (1523, 490+1106),
      ]
    },
    {
      'type': 'line',
      'vertices': [
        (1625, 490),
        (1625, 490+1106),
      ]
    }
  ],
  'piri_pg-085': [
    {
      'type': 'line',
      'vertices': [
        (647, 968),
        (647+102, 968),
      ]
    },
    {
      'type': 'line',
      'vertices': [
        (1187, 1087),
        (1187+102, 1087),
      ]
    },
    {
      'type': 'line',
      'vertices': [
        (1907, 2283),
        (1907+102, 2283),
      ]
    },
    {
      'type': 'line',
      'vertices': [
        (1907, 2404),
        (1907+102, 2404),
      ]
    },
    {
      'type': 'line',
      'vertices': [
        (646, 2404),
        (646+102, 2404),
      ]
    },
    {
      'type': 'line',
      'vertices': [
        (1366, 1805),
        (1366+102, 1805),
      ]
    },
    {
      'type': 'line',
      'vertices': [
        (1366, 1924),
        (1366+102, 1924),
      ]
    },
    {
      'type': 'rect',
      'vertices': [
        (1723, 1800),
        (1723+103, 1800+9),
      ]
    },
    {
      'type': 'line',
      'line_width': 2,
      'vertices': [
        (1726, 1800),
        (1726, 1800+11),
      ]
    },
    {
      'type': 'line',
      'line_width': 2,
      'vertices': [
        (1726, 1804),
        (1726+101, 1804),
      ]
    },
  ],
  'piri_pg-237': [
    {
      'type': 'line',
      'line_width': 2,
      'vertices': [
        (1062, 942),
        (1062+45, 942),
      ]
    },
  ],
  'daegeum_pg-086': [
    {
      'type': 'rect',
      'vertices': [
        (1703, 490),
        (1703+3, 490+10),
      ]
    },
    {
      'type': 'rect',
      'vertices': [
        (1813, 490),
        (1813+3, 490+10),
      ]
    },
    {
      'type': 'rect',
      'vertices': [
        (1703, 1208),
        (1703+3, 1208+14),
      ]
    },
    {
      'type': 'rect',
      'vertices': [
        (1703, 1327),
        (1703+3, 1327+14),
      ]
    },
    {
      'type': 'rect',
      'vertices': [
        (1706, 1683),
        (1706+109, 1683+6),
      ]
    },
  ],
  'daegeum_pg-151': [
    {
      'type': 'rect',
      'vertices': [
        (470, 2606),
        (470+135, 2606+283),
      ]
    },
    {
      'type': 'line',
      'line_width': 2,
      'vertices': [
        (482, 2598),
        (482+105, 2598),
      ]
    },
    {
      'type': 'line',
      'line_width': 3,
      'vertices': [
        (482, 2606),
        (482+105, 2606),
      ]
    },
  ],
  'gayageum_pg-060': [
    {
      'type': 'line',
      'vertices': [
        (996, 1573), 
        (996+101, 1573), 
      ]
    },
  ],
  'gayageum_pg-061': [
    {
      'type': 'rect',
      'vertices': [
        (348, 2078), 
        (348+866, 2078+798),
      ]
    },
  ],
  'gayageum_pg-087': [
    {
      'type': 'line',
      'vertices': [
        (449, 2409), 
        (449+101, 2409), 
      ]
    },
  ],
  'geomungo_pg-103': [
    {
      'type': 'rect',
      'vertices': [
        (994, 2295),
        (994+98, 2295+20),
      ]
    },
  ],
  'geomungo_pg-127': [
    {
      'type': 'line',
      'line_width': 2,
      'vertices': [
        (1454, 691),
        (1454, 691+48),
      ]
    },
    {
      'type': 'line',
      'line_width': 2,
      'vertices': [
        (1454, 1040),
        (1454, 1040+53),
      ]
    },
  ],
  'geomungo_pg-163': [
    {
      'type': 'line',
      'vertices': [
        (1893, 2191),
        (1893+102, 2191),
      ]
    },
  ],
  'geomungo_pg-204': [
    {
      'type': 'rect',
      'vertices': [
        (810, 670),
        (810+109, 670+410),
      ]
    },
  ],
  'geomungo_pg-218': [
    {
      'type': 'rect',
      'vertices': [
        (789, 671),
        (789+132, 671+411),
      ]
    },
  ],
  'ajaeng_pg-036': [
    {
      'type': 'line',
      'vertices': [
        (1740, 621),
        (1740, 621+831),
      ]
    },
    {
      'type': 'line',
      'vertices': [
        (1842, 621),
        (1842, 621+831),
      ]
    },
  ],
}


# SYMBOL NAMES
PNAME_LIST = ['하하배황', '하하배대', '하하배태', '하하배협', '하하배고', '하하배중', '하하배유', '하하배임', '하하배이', '하하배남', '하하배무', '하하배응', '하배황', '하배대', '하배태', '하배협', '하배고', '하배중', '하배유', '하배임', '하배이', '하배남', '하배무', '하배응', '배황', '배대', '배태', '배협', '배고', '배중', '배유', '배임', '배이', '배남', '배무', '배응', '황', '대', '태', '협', '고', '중', '유', '임', '이', '남', '무', '응', '청황', '청대', '청태', '청협', '청고', '청중', '청유', '청임', '청이', '청남', '청무', '청응', '중청황', '중청대', '중청태', '중청협', '중청고', '중청중', '중청유', '중청임', '중청이', '중청남', '중청무', '중청응', '-', '쉼표']

PNAME_EN_LIST = ['hwang-ddd', 'dae-ddd', 'tae-ddd', 'hyeop-ddd', 'go-ddd', 'joong-ddd', 'yu-ddd', 'lim-ddd', 'ee-ddd', 'nam-ddd', 'mu-ddd', 'eung-ddd', 'hwang-dd', 'dae-dd', 'tae-dd', 'hyeop-dd', 'go-dd', 'joong-dd', 'yu-dd', 'lim-dd', 'ee-dd', 'nam-dd', 'mu-dd', 'eung-dd', 'hwang-d', 'dae-d', 'tae-d', 'hyeop-d', 'go-d', 'joong-d', 'yu-d', 'lim-d', 'ee-d', 'nam-d', 'mu-d', 'eung-d', 'hwang', 'dae', 'tae', 'hyeop', 'go', 'joong', 'yu', 'lim', 'ee', 'nam', 'mu', 'eung', 'hwang-u', 'dae-u', 'tae-u', 'hyeop-u', 'go-u', 'joong-u', 'yu-u', 'lim-u', 'ee-u', 'nam-u', 'mu-u', 'eung-u', 'hwang-uu', 'dae-uu', 'tae-uu', 'hyeop-uu', 'go-uu', 'joong-uu', 'yu-uu', 'lim-uu', 'ee-uu', 'nam-uu', 'mu-uu', 'eung-uu', 'conti', 'pause']

SPECIAL_CHAR_TO_NAME = {
  '^': "니레",
  'ㅅ': "니나",
  'ㄷ': "나니로",
  '(': "추성",
  ')': "퇴성",
}

PNAME_EN_TO_KR = {
  'hwang-ddd': '하하배황',
  'dae-ddd': '하하배대',
  'tae-ddd': '하하배태',
  'hyeop-ddd': '하하배협',
  'go-ddd': '하하배고',
  'joong-ddd': '하하배중',
  'yu-ddd': '하하배유',
  'lim-ddd': '하하배임',
  'ee-ddd': '하하배이',
  'nam-ddd': '하하배남',
  'mu-ddd': '하하배무',
  'eung-ddd': '하하배응',
  'hwang-dd': '하배황',
  'dae-dd': '하배대',
  'tae-dd': '하배태',
  'hyeop-dd': '하배협',
  'go-dd': '하배고',
  'joong-dd': '하배중',
  'yu-dd': '하배유',
  'lim-dd': '하배임',
  'ee-dd': '하배이',
  'nam-dd': '하배남',
  'mu-dd': '하배무',
  'eung-dd': '하배응',
  'hwang-d': '배황',
  'dae-d': '배대',
  'tae-d': '배태',
  'hyeop-d': '배협',
  'go-d': '배고',
  'joong-d': '배중',
  'yu-d': '배유',
  'lim-d': '배임',
  'ee-d': '배이',
  'nam-d': '배남',
  'mu-d': '배무',
  'eung-d': '배응',
  'hwang': '황',
  'dae': '대',
  'tae': '태',
  'hyeop': '협',
  'go': '고',
  'joong': '중',
  'yu': '유',
  'lim': '임',
  'ee': '이',
  'nam': '남',
  'mu': '무',
  'eung': '응',
  'hwang-u': '청황',
  'dae-u': '청대',
  'tae-u': '청태',
  'hyeop-u': '청협',
  'go-u': '청고',
  'joong-u': '청중',
  'yu-u': '청유',
  'lim-u': '청임',
  'ee-u': '청이',
  'nam-u': '청남',
  'mu-u': '청무',
  'eung-u': '청응',
  'hwang-uu': '중청황',
  'dae-uu': '중청대',
  'tae-uu': '중청태',
  'hyeop-uu': '중청협',
  'go-uu': '중청고',
  'joong-uu': '중청중',
  'yu-uu': '중청유',
  'lim-uu': '중청임',
  'ee-uu': '중청이',
  'nam-uu': '중청남',
  'mu-uu': '중청무',
  'eung-uu': '중청응',
  'conti': '-',
  'pause': '쉼표',
}

PNAME_KR_TO_EN = {
  '하하배황': 'hwang-ddd',
  '하하배대': 'dae-ddd',
  '하하배태': 'tae-ddd',
  '하하배협': 'hyeop-ddd',
  '하하배고': 'go-ddd',
  '하하배중': 'joong-ddd',
  '하하배유': 'yu-ddd',
  '하하배임': 'lim-ddd',
  '하하배이': 'ee-ddd',
  '하하배남': 'nam-ddd',
  '하하배무': 'mu-ddd',
  '하하배응': 'eung-ddd',
  '하배황': 'hwang-dd',
  '하배대': 'dae-dd',
  '하배태': 'tae-dd',
  '하배협': 'hyeop-dd',
  '하배고': 'go-dd',
  '하배중': 'joong-dd',
  '하배유': 'yu-dd',
  '하배임': 'lim-dd',
  '하배이': 'ee-dd',
  '하배남': 'nam-dd',
  '하배무': 'mu-dd',
  '하배응': 'eung-dd',
  '배황': 'hwang-d',
  '배대': 'dae-d',
  '배태': 'tae-d',
  '배협': 'hyeop-d',
  '배고': 'go-d',
  '배중': 'joong-d',
  '배유': 'yu-d',
  '배임': 'lim-d',
  '배이': 'ee-d',
  '배남': 'nam-d',
  '배무': 'mu-d',
  '배응': 'eung-d',
  '황': 'hwang',
  '대': 'dae',
  '태': 'tae',
  '협': 'hyeop',
  '고': 'go',
  '중': 'joong',
  '유': 'yu',
  '임': 'lim',
  '이': 'ee',
  '남': 'nam',
  '무': 'mu',
  '응': 'eung',
  '청황': 'hwang-u',
  '청대': 'dae-u',
  '청태': 'tae-u',
  '청협': 'hyeop-u',
  '청고': 'go-u',
  '청중': 'joong-u',
  '청유': 'yu-u',
  '청임': 'lim-u',
  '청이': 'ee-u',
  '청남': 'nam-u',
  '청무': 'mu-u',
  '청응': 'eung-u',
  '중청황': 'hwang-uu',
  '중청대': 'dae-uu',
  '중청태': 'tae-uu',
  '중청협': 'hyeop-uu',
  '중청고': 'go-uu',
  '중청중': 'joong-uu',
  '중청유': 'yu-uu',
  '중청임': 'lim-uu',
  '중청이': 'ee-uu',
  '중청남': 'nam-uu',
  '중청무': 'mu-uu',
  '중청응': 'eung-uu',
  '-': 'conti',
  '쉼표': 'pause'
}

SYMBOL_W_DUR_LIST = ['노', '니', '로', '리', '니나*', '느나', '노라', '느니', '노라느니', '니레나', '네로나', '니로나', '니느라니', '느나니나', '느나르나니', '같은음표', '요성표', '겹요성표', '퇴성', '추성']
SYMBOL_W_DUR_EN_LIST = ['no', 'ni', 'ro', 'ri', 'nina-dur', 'neuna', 'nora', 'neuni', 'noraneuni', 'nirena', 'nerona', 'nirona', 'nineurani', 'neunanina', 'neunareunani', 'repeat', 'shake', 'shake-rep', 'bend-down', 'bend-up']

SYMBOL_WO_DUR_LIST = ['나니나', '나느나', '니레', '니나', '니로', '노네', '너녜', '노니로', '노리노', '네로네', '느네느', '나니로', '느로니르', '느니-르', '니루-니', '나니르노니르', '특강표', '늘임표', '흘림표', '겹흘림표', '반길이표', '덧길이표', '미는표', '떠이어표', '끊는표', '농음표', '풀어내림표', '싸랭', '슬기둥1', '슬기둥2', '슬기둥3', '전성', '자출', '잉어질표', '루러표', '시루표', '낮게', '서침표', '느니라', '반길이표/덧길이표', '덧길이표/반길이표']
#'로니로', '격음표'

SYMBOL_WO_DUR_ADD_EN_LIST = ['len-half/len-double', 'len-double/len-half']

SYMBOL_WO_DUR_EN_LIST = ['nanina', 'naneuna', 'nire', 'nina', 'niro', 'none', 'neonye', 'noniro', 'norino', 'nerone', 'neuneneu', 'naniro', 'neuronireu', 'neunireu', 'niruni', 'nanireunonireu', 'accent', 'fermata', 'flow', 'flow-rep', 'len-half', 'len-double', 'push', 'roll', 'staccato', 'vib', 'vib-long', 'diff-str-fast', 'diff-str-1', 'diff-str-2', 'diff-str-3', 'roll-str', 'pizzicato', 'splash', 'between-up', 'between-down', 'down-pitched', 'tongue', 'neunira'] + SYMBOL_WO_DUR_ADD_EN_LIST 
# 'roniro', 'strike'

SYMBOL_LIST = SYMBOL_W_DUR_LIST + SYMBOL_WO_DUR_LIST
SYMBOL_EN_LIST = SYMBOL_W_DUR_EN_LIST + SYMBOL_WO_DUR_EN_LIST

SYMBOL_W_DUR_EN_TO_KR = {
  'no': '노',
  'ni': '니',
  'ro': '로',
  'ri': '리',
  'nina-dur': '니나*',
  'neuna': '느나',
  'nora': '노라',
  'neuni': '느니',
  'noraneuni': '노라느니',
  'nirena': '니레나',
  'nerona': '네로나',
  'nirona': '니로나',
  'nineurani': '니느라니',
  'neunanina': '느나니나',
  'neunareunani': '느나르나니',
  'repeat': '같은음표',
  'shake': '요성표',
  'shake-rep': '겹요성표',
  'bend-down': '퇴성',
  'bend-up': '추성',
}

SYMBOL_W_DUR_KR_TO_EN = {
  '노': 'no',
  '니': 'ni',
  '로': 'ro',
  '리': 'ri',
  '니나*': 'nina-dur',
  '느나': 'neuna',
  '노라': 'nora',
  '느니': 'neuni',
  '노라느니': 'noraneuni',
  '니레나': 'nirena',
  '네로나': 'nerona',
  '니로나': 'nirona',
  '니느라니': 'nineurani',
  '느나니나': 'neunanina',
  '느나르나니': 'neunareunani',
  '같은음표': 'repeat',
  '요성표': 'shake',
  '겹요성표': 'shake-rep',
  '퇴성': 'bend-down',
  '추성': 'bend-up',
}

SYMBOL_WO_DUR_EN_TO_KR = {
  'nanina': '나니나',
  'naneuna': '나느나',
  'nire': '니레',
  'nina': '니나',
  'niro': '니로',
  'none': '노네',
  'neonye': '너녜',
  'noniro': '노니로',
  'norino': '노리노',
  'nerone': '네로네',
  'neuneneu': '느네느',
  'naniro': '나니로',
  # 'roniro': '로니로',
  'neuronireu': '느로니르',
  'neunireu': '느니-르',
  'niruni': '니루-니',
  'nanireunonireu': '나니르노니르',
  'accent': '특강표',
  'fermata': '늘임표',
  'flow': '흘림표',
  'flow-rep': '겹흘림표',
  'len-half': '반길이표',
  'len-double': '덧길이표',
  'push': '미는표',
  'roll': '떠이어표',
  'staccato': '끊는표',
  'vib': '농음표',
  'vib-long': '풀어내림표',
  'len-half/len-double': '반길이표/덧길이표', 
  'len-double/len-half': '덧길이표/반길이표',
  'diff-str-fast': '싸랭',
  'diff-str-1': '슬기둥1',
  'diff-str-2': '슬기둥2',
  'diff-str-3': '슬기둥3',
  'roll-str': '전성',
  'pizzicato': '자출',
  'splash': '잉어질표',
  'between-up': '루러표',
  'between-down': '시루표',
  'down-pitched': '낮게',
  'tongue': '서침표',
  'neunira': '느니라',
}

SYMBOL_WO_DUR_KR_TO_EN = {
  '나니나': 'nanina',
  '나느나': 'naneuna',
  '니레': 'nire',
  '니나': 'nina',
  '니로': 'niro',
  '노네': 'none',
  '너녜': 'neonye',
  '노니로': 'noniro',
  '노리노': 'norino',
  '네로네': 'nerone',
  '느네느': 'neuneneu',
  '나니로': 'naniro',
  # '로니로': 'roniro',
  '느로니르': 'neuronireu',
  '느니-르': 'neunireu',
  '니루-니': 'niruni',
  '나니르노니르': 'nanireunonireu',
  '특강표': 'accent',
  '늘임표': 'fermata',
  '흘림표': 'flow',
  '겹흘림표': 'flow-rep',
  '반길이표': 'len-half',
  '덧길이표': 'len-double',
  '미는표': 'push',
  '떠이어표': 'roll',
  '끊는표': 'staccato',
  '농음표': 'vib',
  '풀어내림표': 'vib-long',
  '반길이표/덧길이표': 'len-half/len-double',
  '덧길이표/반길이표': 'len-double/len-half',
  '싸랭': 'diff-str-fast',
  '슬기둥1': 'diff-str-1',
  '슬기둥2': 'diff-str-2',
  '슬기둥3': 'diff-str-3',
  '전성': 'roll-str',
  '자출': 'pizzicato',
  '잉어질표': 'splash',
  '루러표': 'between-up',
  '시루표': 'between-down',
  '낮게': 'down-pitched',
  '서침표': 'tongue',
  '느니라': 'neunira',
}

NAME_EN_TO_KR = dict(PNAME_EN_TO_KR, **SYMBOL_W_DUR_EN_TO_KR, **SYMBOL_WO_DUR_EN_TO_KR)
NAME_KR_TO_EN = dict(PNAME_KR_TO_EN, **SYMBOL_W_DUR_KR_TO_EN, **SYMBOL_WO_DUR_KR_TO_EN)

NOTE_W_DUR_EN_SET = set(PNAME_EN_LIST + SYMBOL_W_DUR_EN_LIST)